clear all;
%蕨类植物模拟
x=[0.5;0.5];                 %初值
h=plot(x(1),x(2),'.');       %绘制初值点
%设置用于后面随机数的判别向量
p=[0.85 0.92 0.99 1.00];
b1=[0;1.6];
b2=[0;1.6];
b3=[0;0.44];
%--------仿射变换矩阵
A1=[0.85 0.04;-0.04 0.85];
A2=[0.20 -0.26;0.23 0.22];
A3=[-0.15 0.28;0.26 0.24];
A4=[0      0;   0     0.16];
for i=1:20000
    r=rand;                     %产生随机数
    if r < p(1)
        x=A1*x+b1;
    elseif r < p(2)
        x=A2*x+b2;
    elseif r < p(3)
        x=A3*x+b3;
    else
        x=A4*x;
    end
    plot(x(1),x(2),'b'),hold on         %采用绿色绘制
end
axis off
set(gcf,'color','w');